"""
점프 투 파이썬 연습문제 02장
만든이 : 김동현
만든 날짜 : 2020년 07월 10일 금요일
"""
"""
=============================Q1문제 평균 점수를 구하여라 - 딕셔너리 연습을 위해 딕셔너리를 사용해서 품
"""
print("\n1번째 문제\n")
dic = {"국어": 80, "영어": 75, "수학": 55}
a = list(dic.keys())
sum = 0
num = 0

for num in a:
    sum += dic.get(num)

print(sum/3)

"""
=============================Q2문제 자연수 13이 홀수인지 짝수인지 판별하는 함수를 만들어라
"""
print("\n2번째 문제\n")
num = 13

if num%2 == 0:
    print("%d는 짝수입니다." %num)
else:
    print("%d는 홀수입니다." % num)

"""
=============================Q3문제 주민 등록 번호를 구분 지어라(슬라이싱을 활용해라) - 입력형식은 yymmdd-xxxxxx이다.
"""
print("\n3번째 문제\n")
rrn = "881120-1068234"
rrn_yy = rrn.split('-')
#split 함수를 사용하면 리스트가 반환되는것을 확인 할 수 있었다.

print("주민등록번호의 앞부분은 " + rrn_yy[0] + "이고 뒷 부분은 " + rrn_yy[1] + "이다")

"""
=============================Q4문제 주민 등록 번호 중에서 성별 구분자를 추출하여라
"""
print("\n4번째 문제\n")
rrn = "881120-1068234"
sex_num = int(rrn[7])
#위에서 문자열의 인덱스는 잘라낸다 하더라도 str 자료형이기 때문에 int으로 명시적 형변환을 해주었다.

if sex_num == 1:
    print("이 사람의 성별은 남자입니다.")
else:
    print("이 사람의 성별은 여자입니다.")

"""
=============================Q5문제 문자열을 교체해보시오 - replace 활용
"""
print("\n5번째 문제\n")
a = "a:b:c:d"

print(a.replace(':', '#'))

"""
=============================Q6문제 리스트를 정렬하시오 - 내장 함수 중 sort 함수 사용
"""
print("\n6번째 문제\n")
unsort_list = [1, 3, 5, 4, 2]
unsort_list.sort(reverse=True)

print(unsort_list)

"""
=============================Q7문제 리스트를 문자열로 변경하시오 - 문자열의 join 함수 사용
"""
print("\n7번째 문제\n")
list = ['Life', 'is', 'too', 'short']

print(" ".join(list))

"""
=============================Q8문제 튜플에 값을 추가하여라
"""
print("\n8번째 문제\n")
t1 = (1, 2, 3)
t2 = (4,)
t3 = t1 + t2

print(t3)

"""
=============================Q9문제 딕셔너리 연습
"""
print("\n9번째 문제\n")
a = dict()
a['name'] = 'python'
a[('a',)] = 'python'
#a[[1]] = 'python' 리스트는 딕셔너리의 key로 사용 될 수 없다.
a[250] = 'python'

print(a)

"""
=============================Q10문제 딕셔너리에서 특정 key 값의 value 추출 - 딕셔너리의 pop 함수 사용
"""
print("\n10번째 문제\n")
a = {'A':90, 'B':80, 'C':70}

print(a.pop('B'))
#pop을 사용하면 위에서 검색한 값이 딕셔너리에서 아예 삭제된다. 삭제는 필요없다면 get을 사용하면 된다.

"""
=============================Q11문제 리스트에서 중복되는 숫자를 제거하여라
"""
print("\n11번째 문제\n")
a = [1, 1, 1, 2, 2, 3, 3, 3, 4, 4, 5]
b = set(a)#이거는 중복된 요소는 삭제되는 집합의 성질을 이용

print(b)

"""
=============================Q12문제 동일한 주소를 가리키는 객체를 두개 만들고 하나의 객체만 변경하고 결과를 분석하시오
"""
print("\n12번째 문제\n")
a = b = [1, 2, 3]
a[1] = 4
print("a의 주소는 {0}이고, 요소는 다음과 같습니다. : {1}".format(id(a), a))
print("b의 주소는 {0}이고, 요소는 다음과 같습니다. : {1}".format(id(b), b))